-- -*- M2-comint -*- hash: 222471544

i1 : mu = example 3;

o1 : SpecialRationalMap (birational map from hypersurface in PP^5 to PP^4)

i2 : describe inverse mu

o2 = rational map defined by forms of degree 9 having points of multiplicity 2
     along a surface of degree 12 and sectional genus 14 cut out in PP^4 by 9 hypersurfaces of degree 5
     source variety: PP^4
     target variety: smooth cubic hypersurface in PP^5
     dominance: true
     birationality: true (the inverse map is known)
     projective degrees: {1, 9, 27, 15, 3}
     coefficient ring: ZZ/10000019

i3 : S = specialBaseLocus mu;

                 ZZ
o3 : Ideal of --------[x ..x ]
              10000019  0   5

i4 : ? S

o4 = surface of degree 10 and sectional genus 6 in PP^5 cut out by 10
     hypersurfaces of degree 3

i5 : parametrizeSpecialBaseLocus mu;

o5 : RationalMap (rational map from PP^2 to PP^5)

i6 : U = specialBaseLocus inverse mu;

                 ZZ
o6 : Ideal of --------[x ..x ]
              10000019  0   4

i7 : U == nonMinimalAssociatedK3surface 3

o7 = true

i8 : ? U

o8 = surface of degree 12 and sectional genus 14 in PP^4 cut out by 9
     hypersurfaces of degree 5

i9 : mu' = extend mu;

o9 : SpecialRationalMap (dominant rational map from PP^5 to PP^4)

i10 : fibre = mu'^*(point target mu');

                  ZZ
o10 : Ideal of --------[x ..x ]
               10000019  0   5

i11 : ? fibre

o11 = irreducible conic curve in PP^5

i12 : degree(S + fibre)

o12 = 5

i13 : ///for i to 17 do (<<i; time example i)///;
0     -- used 9.95438 seconds
1     -- used 1.09944 seconds
2     -- used 0.933729 seconds
3     -- used 1.12644 seconds
4     -- used 0.8203 seconds
5     -- used 11.4551 seconds
6     -- used 3.38757 seconds
7     -- used 3.57946 seconds
8     -- used 162.847 seconds
9     -- used 555.309 seconds
10     -- used 59.2267 seconds
11     -- used 6.00626 seconds
12     -- used 13.175 seconds
13     -- used 3.67424 seconds
14     -- used 24.7608 seconds
15     -- used 111.319 seconds
16     -- used 625.068 seconds
17     -- used 31.1299 seconds

i14 : describe example(,3)

o14 = rational map defined by forms of degree 3
      source variety: smooth cubic hypersurface in PP^5
      target variety: 4-dimensional variety of degree 20 in PP^8 cut out by 16 hypersurfaces of degree 3
      dominance: true
      birationality: true (the inverse map is already calculated)
      projective degrees: {3, 9, 17, 21, 20}
      number of minimal representatives: 1
      dimension base locus: 2
      degree base locus: 10
      coefficient ring: ZZ/10000019

i15 : describe example(3,)

o15 = rational map defined by forms of degree 5
      source variety: PP^4
      target variety: 4-dimensional variety of degree 20 in PP^8 cut out by 16 hypersurfaces of degree 3
      dominance: true
      birationality: true (the inverse map is already calculated)
      projective degrees: {1, 5, 13, 19, 20}
      number of minimal representatives: 1
      dimension base locus: 2
      degree base locus: 12
      coefficient ring: ZZ/10000019

i16 : 
